solverValidation/benchmarkProject/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       5690;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       5990;
    }
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       6290;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       6300;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6000;
        startFace       6310;
    }
)

// ************************************************************************* //
