solverValidation/benchmarkProject/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              1;

Db              0.182;


// Thermal expansion coefficient
beta            0;

// Reference temperature
TRef            0;

// Laminar Prandtl number
Pr              0.0e2;

// Turbulent Prandtl number
Prt             0.0e2;

// ************************************************************************* //
